Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPH064.atdf
            <instance name="ICAP6">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP7">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
               </parameters>
            </instance>
            <instance name="ICAP8">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
               </parameters>
            </instance>
            <instance name="ICAP9">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
               </parameters>
            </instance>
         </module>
         <module id="02907" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph_pb1_fast" name="INT" name-in-module="INT" offset="0x1f810000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02869" name="JTAG" version="">
            <instance name="JTAG">
               <register-group address-space="periph_pb1_std" name="JTAG" name-in-module="JTAG" offset="0x1f801000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02819" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph_pb1_std" name="NVM" name-in-module="NVM" offset="0x1f800a00" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00749" name="OCMP" version="">
            <instance name="OCMP1">
               <register-group address-space="periph_pb2_std" name="OCMP" name-in-module="OCMP" offset="0x1f824000" />
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 4"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 5"/>
                 </parameters>
            </instance>
            <instance name="OCMP2">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 4"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 5"/>
                 </parameters>
            </instance>
            <instance name="OCMP3">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 4"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 5"/>
                 </parameters>
            </instance>
            <instance name="OCMP4">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
            <instance name="OCMP5">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
            <instance name="OCMP6">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
            <instance name="OCMP7">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
            <instance name="OCMP8">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
            <instance name="OCMP9">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
         </module>
         <module id="03088" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph_pb1_std" name="PCACHE" name-in-module="PCACHE" offset="0x1f800800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
