Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPH064.atdf
         <register caption="Device Configuration Word 3" initval="0xFFFFFFFF" name="DEVCFG3">
            <bitfield caption="Peripheral Pin Select Configuration bit" mask="0x20000000" name="IOL1WAY" values="DEVCFG3__IOL1WAY" />
            <bitfield caption="Peripheral Module Disable Configuration bit" mask="0x10000000" name="PMDL1WAY" values="DEVCFG3__PMDL1WAY" />
            <bitfield caption="Permission Group Lock One Way Configuration bit" mask="0x8000000" name="PGL1WAY" values="DEVCFG3__PGL1WAY" />
            <bitfield caption="PWM Write Access Select bit" mask="0x100000" name="PWMLOCK" values="DEVCFG3__PWMLOCK" />
            <bitfield caption="UserID" mask="0xffff" name="USERID" values="DEVCFG3__USERID" />
         </register>
         <register caption="Device Configuration Word 2" initval="0xC00ABB98" name="DEVCFG2">
            <bitfield caption="Brown-out Reset Select Trip Voltage bit" mask="0x20000000" name="BORSEL" values="DEVCFG2__BORSEL" />
            <bitfield caption="Default System PLL Output Divisor bits" mask="0x70000" name="FPLLODIV" values="DEVCFG2__FPLLODIV" />
            <bitfield caption="System PLL Feedback Divider bits" mask="0x7f00" name="FPLLMULT" values="DEVCFG2__FPLLMULT" />
            <bitfield caption="System PLL Input Clock Select bit" mask="0x80" name="FPLLICLK" values="DEVCFG2__FPLLICLK" />
            <bitfield caption="System PLL Divided Input Clock Frequency Range bits" mask="0x70" name="FPLLRNG" values="DEVCFG2__FPLLRNG" />
            <bitfield caption="PLL Input Divider bits" mask="0x7" name="FPLLIDIV" values="DEVCFG2__FPLLIDIV" />
         </register>
         <register caption="Device Configuration Word 1" initval="0x5F74FFF9" name="DEVCFG1">
            <bitfield caption="Deadman Timer enable bit" mask="0x80000000" name="FDMTEN" values="DEVCFG1__FDMTEN" />
            <bitfield caption="Deadman Timer Count Select bits" mask="0x7c000000" name="DMTCNT" values="DEVCFG1__DMTCNT" />
            <bitfield caption="Watchdog Timer Window Size bits" mask="0x3000000" name="FWDTWINSZ" values="DEVCFG1__FWDTWINSZ" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x800000" name="FWDTEN" values="DEVCFG1__FWDTEN" />
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x400000" name="WINDIS" values="DEVCFG1__WINDIS" />
            <bitfield caption="Watchdog Timer Stop During Flash Programming bit" mask="0x200000" name="WDTSPGM" values="DEVCFG1__WDTSPGM" />
            <bitfield caption="Watchdog Timer Postscale Select bits" mask="0x1f0000" name="WDTPS" values="DEVCFG1__WDTPS" />
            <bitfield caption="Clock Switching and Monitoring Selection Configuration bits" mask="0xc000" name="FCKSM" values="DEVCFG1__FCKSM" />
            <bitfield caption="CLKO Enable Configuration bit" mask="0x400" name="OSCIOFNC" values="DEVCFG1__OSCIOFNC" />
            <bitfield caption="Primary Oscillator Configuration bits" mask="0x300" name="POSCMOD" values="DEVCFG1__POSCMOD" />
            <bitfield caption="Internal External Switchover bit" mask="0x80" name="IESO" values="DEVCFG1__IESO" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x40" name="FSOSCEN" values="DEVCFG1__FSOSCEN" />
            <bitfield caption="Deadman Timer Count Window Interval bits" mask="0x38" name="DMTINTV" values="DEVCFG1__DMTINTV" />
            <bitfield caption="Oscillator Selection bits" mask="0x7" name="FNOSC" values="DEVCFG1__FNOSC" />
         </register>
         <register caption="Device Configuration Word 0" initval="0x7FFFF7DB" name="DEVCFG0">
            <bitfield caption="EJTAG Boot Enable bit" mask="0x40000000" name="EJTAGBEN" values="DEVCFG0__EJTAGBEN" />
            <bitfield caption="Primary Oscillator Automatic Gain Control bit" mask="0x8000000" name="POSCAGC" values="DEVCFG0__POSCAGC" />
            <bitfield caption="Primary Crystal AGC Gain Search Step Settling Time Control bits" mask="0x3000000" name="POSCAGCDLY" values="DEVCFG0__POSCAGCDLY" />
            <bitfield caption="Primary Crystal Oscillator Fine Gain Control bits" mask="0xc00000" name="POSCFGAIN" values="DEVCFG0__POSCFGAIN" />
            <bitfield caption="Primary Oscillator Boost bit" mask="0x200000" name="POSCBOOST" values="DEVCFG0__POSCBOOST" />
            <bitfield caption="Primary Crystal Oscillator Course Gain Control bits" mask="0x180000" name="POSCGAIN" values="DEVCFG0__POSCGAIN" />
            <bitfield caption="Secondary Oscillator Kick Start Programmability bit" mask="0x40000" name="SOSCBOOST" values="DEVCFG0__SOSCBOOST" />
            <bitfield caption="Secondary Oscillator Gain Control bits" mask="0x30000" name="SOSCGAIN" values="DEVCFG0__SOSCGAIN" />
            <bitfield caption="Soft Master Clear Enable bit" mask="0x8000" name="SMCLR" values="DEVCFG0__SMCLR" />
            <bitfield caption="Debug Mode CPU Access Permission" mask="0x7000" name="DBGPER" values="DEVCFG0__DBGPER" />
            <bitfield caption="Flash Sleep Mode bit" mask="0x400" name="FSLEEP" values="DEVCFG0__FSLEEP" />
            <bitfield caption="Dynamic Flash ECC Configuration bits" mask="0x300" name="FECCCON" values="DEVCFG0__FECCCON" />
            <bitfield caption="Boot ISA Selection bit" mask="0x40" name="BOOTISA" values="DEVCFG0__BOOTISA" />
            <bitfield caption="Trace Enable bit" mask="0x20" name="TRCEN" values="DEVCFG0__TRCEN" />
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x18" name="ICESEL" values="DEVCFG0__ICESEL" />
            <bitfield caption="JTAG Enable bit" mask="0x4" name="JTAGEN" values="DEVCFG0__JTAGEN" />
            <bitfield caption="Background Debugger Enable bits" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG" />
         </register>
         <register caption="Device Sequence 3" name="DEVSEQ3" initval="0xffff0000">
            <bitfield caption="Boot Flash True Sequence Number" mask="0xffff" name="TSEQ" values="DEVSEQ3__TSEQ" />
            <bitfield caption="Boot Flash Complement Sequence Number" mask="0xffff0000" name="CSEQ" values="DEVSEQ3__CSEQ" />
         </register>
      </register-group>
      <value-group caption="OP-Amp 1 differential input configuration" name="DEVCFG4__A1DIFFPR">
         <value caption="Uses Both PMOS and NMOS Differential Pair" name="USE_PMOS_NMOS" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x1" />
      </value-group>
      <value-group caption="OP-Amp 2 differential input configuration" name="DEVCFG4__A2DIFFPR">
         <value caption="Uses Both PMOS and NMOS Differential Pair" name="USE_PMOS_NMOS" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x1" />
      </value-group>
      <value-group caption="OP-Amp 3 differential input configuration" name="DEVCFG4__A3DIFFPR">
         <value caption="Uses Both PMOS and NMOS Differential Pair" name="USE_PMOS_NMOS" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x1" />
      </value-group>
