Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPH064.atdf
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL15">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL16">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL17">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL18">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL19">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL20">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL21">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL22">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL23">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL24">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL25">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL26">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL27">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC0TIME__SAMC">
         <value caption="1025 TADx" name="" value="0x3ff" />
         <value caption="3 TADx" name="" value="0x1" />
         <value caption="2 TADx" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC0TIME__ADCDIV">
         <value caption="254 * TQ = TADx" name="" value="0x7f" />
         <value caption="6 * TQ = TADx" name="" value="0x3" />
         <value caption="4 * TQ = TADx" name="" value="0x2" />
         <value caption="2 * TQ = TADx" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Channel Enable bit" name="ADC0TIME__BCHEN">
         <value caption="ADC data saved in DMA system ram buffer when DMAEN (ADCDSTAT) = 1" name="" value="0x1" />
         <value caption="ADC data must be read by CPU from appropriate ADC result register" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC0TIME__SELRES">
         <value caption="12 bits" name="" value="0x3" />
         <value caption="10 bits" name="" value="0x2" />
         <value caption="8 bits" name="" value="0x1" />
         <value caption="6 bits" name="" value="0x0" />
      </value-group>
