Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPH064.atdf
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN2">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN3">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN4">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN5">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN7">
         <value caption="Enable interrupt and generate interrupt when the WKRDY7 status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake-up Clock Count bits" name="ADCANCON__WKUPCLKCNT">
         <value caption="2^15 = 32768 clocks" name="" value="0xf" />
         <value caption="2^14 = 16384 clocks" name="" value="0xe" />
         <value caption="2^13 = 8192 clocks" name="" value="0xd" />
         <value caption="2^12 = 4096 clocks" name="" value="0xc" />
         <value caption="2^11 = 2048 clocks" name="" value="0xb" />
         <value caption="2^10 = 1024 clocks" name="" value="0xa" />
         <value caption="2^9 = 512 clocks" name="" value="0x9" />
         <value caption="2^8 = 256 clocks" name="" value="0x8" />
         <value caption="2^7 = 128 clocks" name="" value="0x7" />
         <value caption="2^6 = 64 clocks" name="" value="0x6" />
         <value caption="2^5 = 32 clocks" name="" value="0x5" />
         <value caption="2^4 = 16 clocks" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="03247" name="CAN" version="">
      <register-group name="CAN">
         <register caption="CAN Control Register" name="CFD1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="CFD1CON__DNCNT" />
            <bitfield caption="Enable ISO CRC in CAN FD Frames bit" mask="0x00000020" name="ISOCRCEN" values="CFD1CON__ISOCRCEN" />
            <bitfield caption="Protocol Exception Event Detection Disabled bit" mask="0x00000040" name="PXEDIS" values="CFD1CON__PXEDIS" />
            <bitfield caption="Module Clock Source Select bit" mask="0x00000080" name="CLKSEL0" values="CFD1CON__CLKSEL0" />
            <bitfield caption="Enable CAN Bus Line Wake-up Filter bit" mask="0x00000100" name="WAKFIL" values="CFD1CON__WAKFIL" />
            <bitfield caption="Selectable Wake-up Filter Time bits" mask="0x00000600" name="WFT" values="CFD1CON__WFT" />
            <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="BUSY" values="CFD1CON__BUSY" />
            <bitfield caption="Bit Rate Switching Disable bit" mask="0x00001000" name="BRSDIS" values="CFD1CON__BRSDIS" />
            <bitfield caption="Stop-in-Idle Control bit" mask="0x00002000" name="SIDL" values="CFD1CON__SIDL" />
            <bitfield caption="Enable bit" mask="0x00008000" name="ON" values="CFD1CON__ON" />
            <bitfield caption="Restrict Retransmission Attempts bit" mask="0x00010000" name="RTXAT" values="CFD1CON__RTXAT" />
            <bitfield caption="Transmit ESI in Gateway Mode bit" mask="0x00020000" name="ESIGM" values="CFD1CON__ESIGM" />
            <bitfield caption="Transition to Listen Only Mode on System Error bit" mask="0x00040000" name="SERR2LOM" values="CFD1CON__SERR2LOM" />
            <bitfield caption="Store in Transmit Event FIFO bit" mask="0x00080000" name="STEF" values="CFD1CON__STEF" />
            <bitfield caption="Enable Transmit Queue bit" mask="0x00100000" name="TXQEN" values="CFD1CON__TXQEN" />
            <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="CFD1CON__OPMOD" />
            <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="CFD1CON__REQOP" />
            <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="CFD1CON__ABAT" />
            <bitfield caption="Transmit Bandwidth Sharing bits" mask="0xF0000000" name="TXBWS" values="CFD1CON__TXBWS" />
         </register>
         <register caption="Nominal Bit Time Configuration Register" name="CFD1NBTCFG" offset="0x10" rw="RW" size="4">
            <bitfield caption="Synchronization Jump Width bits" mask="0x0000007F" name="SJW" values="CFD1NBTCFG__SJW" />
            <bitfield caption="Time Segment 2 bits" mask="0x00007F00" name="TSEG2" values="CFD1NBTCFG__TSEG2" />
            <bitfield caption="Time Segment 1 bits" mask="0x00FF0000" name="TSEG1" values="CFD1NBTCFG__TSEG1" />
            <bitfield caption="Baud Rate Prescaler bits" mask="0xFF000000" name="BRP" values="CFD1NBTCFG__BRP" />
         </register>
         <register caption="Data Bit Time Configuration Register" name="CFD1DBTCFG" offset="0x20" rw="RW" size="4">
            <bitfield caption="Synchronization Jump Width bits" mask="0x0000000F" name="SJW" values="CFD1DBTCFG__SJW" />
            <bitfield caption="Time Segment 2 bits" mask="0x00000F00" name="TSEG2" values="CFD1DBTCFG__TSEG2" />
            <bitfield caption="Time Segment 1 bits" mask="0x001F0000" name="TSEG1" values="CFD1DBTCFG__TSEG1" />
            <bitfield caption="Baud Rate Prescaler bits" mask="0xFF000000" name="BRP" values="CFD1DBTCFG__BRP" />
         </register>
         <register caption="Transmitter Delay Compensation Register" name="CFD1TDC" offset="0x30" rw="RW" size="4">
            <bitfield caption="Transmitter Delay Compensation Value bits; Secondary Sample Point" mask="0x0000003F" name="TDCV" values="CFD1TDC__TDCV" />
            <bitfield caption="Transmitter Delay Compensation Offset bits" mask="0x00007F00" name="TDCO" values="CFD1TDC__TDCO" />
            <bitfield caption="Transmitter Delay Compensation Mode bits" mask="0x00030000" name="TDCMOD" values="CFD1TDC__TDCMOD" />
            <bitfield caption="Enable 12-Bit SID in CAN FD Base Format Messages bit" mask="0x01000000" name="SID11EN" values="CFD1TDC__SID11EN" />
            <bitfield caption="Enable Edge Filtering during Bus Integration state bit" mask="0x02000000" name="EDGFLTEN" values="CFD1TDC__EDGFLTEN" />
         </register>
         <register caption="CAN Time Base Counter Register" name="CFD1TBC" offset="0x40" rw="RW" size="4">
            <bitfield caption="CAN Base Counter bits" mask="0xFFFFFFFF" name="TBC" />
         </register>
         <register caption="CAN Time Stamp Control Register" name="CFD1TSCON" offset="0x50" rw="RW" size="4">
            <bitfield caption="CAN Time Base Counter Prescaler bits" mask="0x000003FF" name="TBCPRE" values="CFD1TSCON__TBCPRE" />
            <bitfield caption="Time Base Counter Enable bit" mask="0x00010000" name="TBCEN" values="CFD1TSCON__TBCEN" />
            <bitfield caption="Time Stamp EOF bit" mask="0x00020000" name="TSEOF" values="CFD1TSCON__TSEOF" />
            <bitfield caption="Time Stamp Resolution bit" mask="0x00040000" name="TSRES" values="CFD1TSCON__TSRES" />
         </register>
         <register caption="Interrupt Code Register" name="CFD1VEC" offset="0x60" rw="RW" size="4">
            <bitfield caption="Interrupt Flag Code bits" mask="0x0000007F" name="ICODE" values="CFD1VEC__ICODE" />
            <bitfield caption="Filter Hit Number bits" mask="0x00001F00" name="FILHIT" values="CFD1VEC__FILHIT" />
            <bitfield caption="Transmit Interrupt Flag Code bits" mask="0x007F0000" name="TXCODE" values="CFD1VEC__TXCODE" />
            <bitfield caption="Receive Interrupt Flag Code bits" mask="0x7F000000" name="RXCODE" values="CFD1VEC__RXCODE" />
         </register>
