Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPH064.atdf
         <register caption="Filter Object Register" name="CFD1FLTOBJ24" offset="0xac0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ24__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ24__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK24" offset="0xad0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK24__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK24__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ25" offset="0xae0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ25__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ25__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK25" offset="0xaf0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK25__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK25__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ26" offset="0xb00" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ26__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ26__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK26" offset="0xb10" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK26__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK26__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ27" offset="0xb20" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ27__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ27__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK27" offset="0xb30" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK27__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK27__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ28" offset="0xb40" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ28__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ28__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK28" offset="0xb50" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK28__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK28__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ29" offset="0xb60" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ29__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ29__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK29" offset="0xb70" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK29__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK29__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ30" offset="0xb80" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ30__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ30__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK30" offset="0xb90" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK30__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK30__MIDE" />
         </register>
         <register caption="Filter Object Registe" name="CFD1FLTOBJ31" offset="0xba0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ31__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ31__EXIDE" />
         </register>
         <register caption="Filter Object Registe" name="CFD1MASK31" offset="0xbb0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK31__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK31__MIDE" />
         </register>
      </register-group>
