Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPH064.atdf
      <value-group caption="CAN Timer Overflow Interrupt Flag bit" name="CFD1INT__TBCIF">
         <value caption="TBC has overflowed" name="" value="0x1" />
         <value caption="TBC did not overflow" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Mode Change Interrupt Flag bit" name="CFD1INT__MODIF">
         <value caption="CAN module mode change occurred (OPMOD has changed to reflect the REQOP bits)" name="" value="0x1" />
         <value caption="No mode change occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Event FIFO Interrupt Flag bit" name="CFD1INT__TEFIF">
         <value caption="Receive buffer overflow occurred" name="" value="0x1" />
         <value caption="No receive buffer overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Attempt Interrupt Flag bit" name="CFD1INT__TXATIF">
         <value caption="A transmit interrupt is pending in one or more of the designated 32 FIFOs denoted by which of the 32 bits in the CFDxTXATIF register are set" name="" value="0x1" />
         <value caption="No transmit FIFO interrupts are pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Object Overflow Interrupt Flag bit" name="CFD1INT__RXOVIF">
         <value caption="Receive object overflow occurred" name="" value="0x1" />
         <value caption="No receive object overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="System Error Interrupt Flag bit" name="CFD1INT__SERRIF">
         <value caption="A system error occurred (collision on dual-port RAM)" name="" value="0x1" />
         <value caption="No system error occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Flag bit" name="CFD1INT__CERRIF">
         <value caption="A CAN bus error interrupt is pending" name="" value="0x1" />
         <value caption="No CAN bus error interrupts are pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Wake Up Activity Interrupt Flag bit" name="CFD1INT__WAKIF">
         <value caption="A wake-up interrupt is pending" name="" value="0x1" />
         <value caption="No wake-up interrupts are pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Invalid Message Interrupt Flag bit" name="CFD1INT__IVMIF">
         <value caption="An invalid message interrupt is pending" name="" value="0x1" />
         <value caption="No invalid message interrupts are pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Object Interrupt Enable bit" name="CFD1INT__TXIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Object Interrupt Enable bit" name="CFD1INT__RXIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Timer Interrupt Enable bit" name="CFD1INT__TBCIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Change Interrupt Enable bit" name="CFD1INT__MODIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Event FIFO Interrupt Enable bit" name="CFD1INT__TEFIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
      </value-group>
      <value-group caption="Transmit Attempt Interrupt Enable bit" name="CFD1INT__TXATIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Enable bit" name="CFD1INT__RXOVIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="System Error Interrupt Enable bit" name="CFD1INT__SERRIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Enable bit" name="CFD1INT__CERRIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Wake Up Activity Interrupt Enable bit" name="CFD1INT__WAKIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Invalid Message Interrupt Enable bit" name="CFD1INT__IVMIE">
         <value caption="Interrupts are enabled" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Interrupt Pending bits" name="CFD1RXIF__RFIF">
         <value caption="One or more enabled receive FIFO interrupts are pending" name="" value="0x1" />
         <value caption="No enabled receive FIFO interrupts are pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO/Transmit Queue Interrupt Pending bits" name="CFD1TXIF__TFIF">
         <value caption="One or more enabled transmit FIFO/Transmit Queue interrupts are pending" name="" value="0x1" />
         <value caption="No enabled transmit FIFO/Transmit Queue interrupt are pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Overflow Interrupt Pending bits" name="CFD1RXOVIF__RFOVIF">
         <value caption="Interrupt is pending" name="" value="0x1" />
         <value caption="Interrupt not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO/Transmit Queue Attempt Interrupt Pending bits" name="CFD1TXATIF__TFATIF">
         <value caption="A transmit interrupt is pending in one or more of the designated 32 FIFOs denoted by which of the 32 bits in the CFDxTXATIF register are set" name="" value="0x1" />
         <value caption="No transmit FIFO interrupts are pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Error Counter bits" name="CFD1TREC__RERRCNT">
         <value caption="Greater than or equal to 255 Receive errors" name="" value="0xff" />
         <value caption="254 receive errors" name="" value="0xfe" />
         <value caption="1 receive error" name="" value="0x1" />
         <value caption="No receive errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Error Counter bits" name="CFD1TREC__TERRCNT">
         <value caption="Greater than or equal to 255 Transmit errors." name="" value="0xff" />
         <value caption="254 Transmit errors" name="" value="0xfe" />
         <value caption="1 transmit error" name="" value="0x1" />
         <value caption="No transmit errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmitter or Receiver is in Error State Warning bit" name="CFD1TREC__EWARN">
         <value caption="TXWARN or RXWARN is set" name="" value="0x1" />
         <value caption="No transmit or receive warnings" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver in Error State Warning bit (128 greater than RERRCNT greater than 95)" name="CFD1TREC__RXWARN">
         <value caption="Indicates that the number of receives errors is less than 128" name="" value="0x1" />
         <value caption="Indicates that receive errors are greater than or equal to 95" name="" value="0x0" />
      </value-group>
