Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPH064.atdf
         <register caption="" name="EBASE" offset="0xf4" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="CPUNum" />
            <bitfield mask="0x3FFFF000" name="ExBase" />
         </register>
         <register caption="" name="CDMMBase" offset="0xf8" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="CDMMSize" />
            <bitfield mask="0x00000200" name="CI" />
            <bitfield mask="0x00000400" name="EN" />
            <bitfield mask="0xFFFFF800" name="CDMMUA" />
         </register>
         <register caption="Configuration Register; CP0 Register 16, Select 0" name="Config" offset="0xfc" rw="RW" size="4">
            <bitfield caption="Kseg0 Coherency Algorithm bits" mask="0x00000007" name="K0" values="Config__K0" />
            <bitfield caption="MMU Type bits" mask="0x00000380" name="MT" values="Config__MT" />
            <bitfield caption="Architecture Revision Level bits" mask="0x00001C00" name="AR" values="Config__AR" />
            <bitfield caption="Architecture Type bits" mask="0x00006000" name="AT" values="Config__AT" />
            <bitfield caption="Endian Mode bit" mask="0x00008000" name="BE" values="Config__BE" />
            <bitfield caption="Burst Mode bit" mask="0x00010000" name="BM" values="Config__BM" />
            <bitfield caption="Merge Mode bits" mask="0x00060000" name="MM" values="Config__MM" />
            <bitfield caption="Multiply/Divide Unit bit" mask="0x00100000" name="MDU" values="Config__MDU" />
            <bitfield caption="SimpleBE bit" mask="0x00200000" name="SB" values="Config__SB" />
            <bitfield caption="User-defined bit" mask="0x00400000" name="UDI" values="Config__UDI" />
            <bitfield caption="Data Scratch Pad RAM bit" mask="0x00800000" name="DSP" values="Config__DSP" />
            <bitfield caption="Instruction Scratch Pad RAM bit" mask="0x01000000" name="ISP" values="Config__ISP" />
            <bitfield mask="0x0E000000" name="KU" />
            <bitfield mask="0x70000000" name="K23" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="Configuration Register 1; CP0 Register 16, Select 1" name="Config1" offset="0x100" rw="R" size="4">
            <bitfield caption="Floating Point Unit bit" mask="0x00000001" name="FP" values="Config1__FP" />
            <bitfield caption="EJTAG Present bit" mask="0x00000002" name="EP" values="Config1__EP" />
            <bitfield caption="Code Compression Implemented bit" mask="0x00000004" name="CA" values="Config1__CA" />
            <bitfield caption="Watch Register Presence bit" mask="0x00000008" name="WR" values="Config1__WR" />
            <bitfield caption="Performance Counter bit" mask="0x00000010" name="PC" values="Config1__PC" />
            <bitfield caption="Data-Cache Associativity bits" mask="0x00000380" name="DA" values="Config1__DA" />
            <bitfield caption="Data-Cache Line bits" mask="0x00001C00" name="DL" values="Config1__DL" />
            <bitfield caption="Data-Cache Sets bits" mask="0x0000E000" name="DS" values="Config1__DS" />
            <bitfield caption="Instruction-Cache Associativity bits" mask="0x00070000" name="IA" values="Config1__IA" />
            <bitfield caption="Instruction-Cache Line bits" mask="0x00380000" name="IL" values="Config1__IL" />
            <bitfield caption="Instruction Cache Sets bits" mask="0x01C00000" name="IS" values="Config1__IS" />
            <bitfield mask="0x7E000000" name="MMUsz" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Config2" offset="0x104" rw="R" size="4">
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="Configuration Register 3; CP0 Register 16, Select 3" name="Config3" offset="0x108" rw="RW" size="4">
            <bitfield caption="Trace Logic bit" mask="0x00000001" name="TL" values="Config3__TL" />
            <bitfield caption="Common Device Memory Map bit" mask="0x00000008" name="CDMM" values="Config3__CDMM" />
            <bitfield caption="Small Page bit" mask="0x00000010" name="SP" values="Config3__SP" />
            <bitfield caption="Vector Interrupt bit" mask="0x00000020" name="VInt" values="Config3__VInt" />
            <bitfield caption="External Vector Interrupt Controller bit" mask="0x00000040" name="VEIC" values="Config3__VEIC" />
            <bitfield caption="Indicates that iFlowtrace hardware is present" mask="0x00000100" name="ITL" values="Config3__ITL" />
            <bitfield caption="MIPS DSP ASE Presence bit" mask="0x00000400" name="DSPP" values="Config3__DSPP" />
            <bitfield caption="MIPS DSP ASE Revision 2 Presence bit" mask="0x00000800" name="DSP2P" values="Config3__DSP2P" />
            <bitfield caption="RIE and XIE Implemented in PageGrain bit" mask="0x00001000" name="RXI" values="Config3__RXI" />
            <bitfield caption="UserLocal Register Implemented bit" mask="0x00002000" name="ULRI" values="Config3__ULRI" />
            <bitfield caption="Instruction Set Availability bits" mask="0x0000C000" name="ISA" values="Config3__ISA" />
            <bitfield caption="ISA on Exception bit" mask="0x00010000" name="ISAONEXC" values="Config3__ISAONEXC" />
            <bitfield caption="MIPS MCU ASE Implemented bit" mask="0x00020000" name="MCU" values="Config3__MCU" />
            <bitfield caption="microMIPS Architecture Revision Level bits" mask="0x001C0000" name="MMAR" values="Config3__MMAR" />
            <bitfield caption="Width of the Status IPL and Cause RIPL bits" mask="0x00600000" name="IPLW" values="Config3__IPLW" />
            <bitfield mask="0x00800000" name="VZ" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Config4" offset="0x10c" rw="R" size="4">
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="Configuration Register 5; CP0 Register 16, Select 5" name="Config5" offset="0x110" rw="RW" size="4">
            <bitfield caption="Nested Fault bit" mask="0x00000001" name="NF" values="Config5__NF" />
            <bitfield mask="0x00000004" name="UFR" />
            <bitfield mask="0x80000000" name="M" />
         </register>
