Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPH064.atdf
         <register caption="DMA Channel x Source Pointer Register" name="DCH6SPTR" offset="0x550" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH6SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH7SPTR" offset="0x610" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH7SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH0DPTR" offset="0xe0" rw="RW" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH0DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH1DPTR" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH1DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH2DPTR" offset="0x260" rw="RW" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH2DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH3DPTR" offset="0x320" rw="RW" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH3DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH4DPTR" offset="0x3e0" rw="RW" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH4DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH5DPTR" offset="0x4a0" rw="RW" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH5DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH6DPTR" offset="0x560" rw="RW" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH6DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Destination Pointer Register" name="DCH7DPTR" offset="0x620" rw="RW" size="4">
            <bitfield caption="Channel Destination Pointer bits" mask="0x0000FFFF" name="CHDPTR" values="DCH7DPTR__CHDPTR" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH0CSIZ" offset="0xf0" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH0CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH1CSIZ" offset="0x1b0" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH1CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH2CSIZ" offset="0x270" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH2CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH3CSIZ" offset="0x330" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH3CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH4CSIZ" offset="0x3f0" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH4CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH5CSIZ" offset="0x4b0" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH5CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH6CSIZ" offset="0x570" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH6CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell-Size Register" name="DCH7CSIZ" offset="0x630" rw="RW" size="4">
            <bitfield caption="Channel Cell-Size bits" mask="0x0000FFFF" name="CHCSIZ" values="DCH7CSIZ__CHCSIZ" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH0CPTR" offset="0x100" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH0CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH1CPTR" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH1CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH2CPTR" offset="0x280" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH2CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH3CPTR" offset="0x340" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH3CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH4CPTR" offset="0x400" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH4CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH5CPTR" offset="0x4c0" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH5CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH6CPTR" offset="0x580" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH6CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Cell Pointer Register" name="DCH7CPTR" offset="0x640" rw="RW" size="4">
            <bitfield caption="Channel Cell Progress Pointer bits" mask="0x0000FFFF" name="CHCPTR" values="DCH7CPTR__CHCPTR" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH0DAT" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
