Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPH064.atdf
      <value-group caption="Timer1 External Clock Selection bits" name="T1CON__TECS">
         <value caption="External clock comes from the LPRC" name="" value="0x2" />
         <value caption="External clock comes from the T1CK pin" name="" value="0x1" />
         <value caption="External clock comes from the SOSC" name="" value="0x0" />
      </value-group>
      <value-group caption="Asynchronous Timer Write in Progress bit" name="T1CON__TWIP">
         <value caption="(In Asynchronous Timer mode) Asynchronous write to TMR1 register in progress / (In Synchronous Timer mode)bit is read as 0" name="" value="0x1" />
         <value caption="In Asynchronous Timer mode Asynchronous write to TMR1 register complete / (In Synchronous Timer mode)bit is read as 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Asynchronous Timer Write Disable bit" name="T1CON__TWDIS">
         <value caption="Writes to TMR1 are ignored until pending write operation completes" name="" value="0x1" />
         <value caption="Back-to-back writes are enabled (Legacy Asynchronous Timer functionality)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T1CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T1CON__ON">
         <value caption="Timer is enabled" name="" value="0x1" />
         <value caption="Timer is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02815" name="TMR" version="1">
      <register-group name="TMR">
         <register caption="Timer Configuration" name="T2CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T2CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T2CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T2CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T2CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T2CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T2CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T2CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T3CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T3CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T3CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T3CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T3CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T3CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T3CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T3CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T4CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T4CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T4CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T4CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T4CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T4CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T4CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T4CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T5CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T5CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T5CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T5CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T5CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T5CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T5CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T5CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T6CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T6CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T6CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T6CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T6CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T6CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T6CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T6CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T7CON" offset="0xa00" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T7CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T7CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T7CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T7CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T7CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T7CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T7CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T8CON" offset="0xc00" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T8CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T8CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T8CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T8CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T8CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T8CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T8CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T9CON" offset="0xe00" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T9CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T9CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T9CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T9CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T9CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T9CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T9CON__ON" />
         </register>
         <register caption="Timer" name="TMR2" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR2" />
         </register>
         <register caption="Timer" name="TMR3" offset="0x210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR3" />
         </register>
